{
  "data": [
    {
      "body": "<p><img src=\"https://user-images.githubusercontent.com/32632542/157171355-6345e6bf-420a-45ca-a0ec-83e0a7d924ef.png\" alt=\"image\"></p>\n<h2>Introduction</h2>\n<p>I work as a frontend-engineer and mostly use <a href=\"https://reactjs.org/\">React</a> at work. I was looking for a different frontend framework that <strong>dose not</strong> use Virtual DOM to have more diverse skills under my belt.</p>\n<p>I was always curious about <a href=\"https://svelte.dev/\">Svelte</a> and heard actually a lot of good things about it from people around me.</p>\n<p>So I tried it out.</p>\n<h2>Svelte</h2>\n<p>There are already many posts about <a href=\"https://svelte.dev/\">Svelte</a> by other people and reading the official document should be enough to start making stuff with it.</p>\n<p>The syntax was very straightforward and I liked it a lot.</p>\n<h2>Sveltekit</h2>\n<p>According to the <a href=\"https://kit.svelte.dev/\">official document</a>,</p>\n<blockquote>\n<p>SvelteKit is a framework for building web applications of all sizes, with a beautiful development experience and flexible filesystem-based routing.</p>\n</blockquote>\n<h2>Vite</h2>\n<p>Sveltekit internally uses <a href=\"https://vitejs.dev/\">Vite</a> as its build tool.</p>\n<p>This surely provided the <code>faster and leaner</code> experince It promised. The <code>HMR</code> was absolutely instantaneous.</p>\n<h2>Hosting</h2>\n<p>I also tried <a href=\"https://vercel.com/\">vercel</a> to host this blog. Hosting the site was extremely simple and easy. Setting the custom domain also was easy. Probably the best hosting service I've used so far.</p>\n<h2>Other stuff</h2>\n<p>I made a <a href=\"https://github.com/K-Sato1995/md-to-json-converter\">package</a> that converts markdown files into JSON for this.</p>\n",
      "title": "New blog made with Sveltekit",
      "date": "2022-03-08T00:00:00.000Z",
      "description": "I created this blog with sveltekit. And the development experience was amazing.",
      "isCompleted": true,
      "slug": "new-blog-made-with-sveltekit",
      "tags": [
        "svelte",
        "sveltekit",
        "vercel",
        "vite"
      ]
    },
    {
      "body": "<p><img src=\"https://user-images.githubusercontent.com/32632542/158548763-5d8a99b1-618f-4cdf-9e81-18e0a3773bdd.jpeg\" alt=\"情熱\"></p>\n<h2>Intro</h2>\n<p>I've been having a lot of free time lately for reasons I won't disclose here. And I've been using that time to code. And I feel like I've kinda rediscovered love and passion for coding.</p>\n<h2>Background info</h2>\n<p>I've been coding for the last 5 ~ 6 years or so according to my GitHub profile ,I know it's not that long, and been coding professionally for the last 4 years. To be honest, I consider myself very hard working and diligent. But I noticed that I kinda didn't code or study that much outside of my job for the last few months. And there was an event that made me question why I'm working as a software engineer and if this occupation is a good fit for me. So I tried to remember why I chose this career path.</p>\n<p><img src=\"https://user-images.githubusercontent.com/32632542/158554737-cecb172a-7f1e-4144-a452-c26fe60420c1.gif\" alt=\"200\"></p>\n<h2>Conclusion</h2>\n<p>The conclusion I came to was that I actually like creating random stuff. But lately I've been so caught up with very complicated stuff like &quot;algorithms&quot;, &quot;performance&quot;, &quot;best practices&quot;....etc. Not saying I don't like the stuff. I actually love making web sites faster or making my code clear...etc. I was simply so caught up and coding kinda became something I didn't necessarily enjoy.</p>\n<p>So I just started creating random stuff for myself without thinking too much about the values of the stuff, the performance or anything like that.</p>\n<p>This blog is one of those things I've recently created. It's not the fastest site in the world or best looking site in the world or anything. But it is something I like and something that represents myself. And ,most importantly, it is something I really enjoyed creating. While I was working on the stuff I've made lately, I just wanted to use all my time working on those things. That is true passion.</p>\n<p>I am glad that I could remember the reason why I actually like what I do. I would like to keep coding and keep getting better. And hopefully I will  never forget why I like coding and feel passionate about it.</p>\n",
      "title": "Rediscovering love and passion for coding",
      "date": "2022-03-16T00:00:00.000Z",
      "description": "I've rediscovered love and passion for coding.",
      "isCompleted": true,
      "slug": "coding-is-fun",
      "tags": []
    }
  ]
}